app/views/ballots/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 20]]
---
        A New Member Added
        <% if User.find(@ballot.member_id) == current_user %>

SELECT "communities".* FROM "communities" WHERE "communities"."id" = 7 LIMIT 1
SELECT "cvotes".* FROM "cvotes" WHERE "cvotes"."id" = ? LIMIT 1  [["id", 76]]
---
      <% elsif @ballot.vote_type == "new_community" %>
        You are invited to a new <p><h3><%= Community.find(@ballot.content_id).name %></h3> </p>community.
        <%= form_tag url_for(:controller => "cvotes", :action => "voteaction", :id => @myvote.id), :metohd => "put" do %>

SELECT "users".* FROM "users" INNER JOIN "cvotes" ON "users"."id" = "cvotes"."user_id" WHERE "cvotes"."ballot_id" = 16
---
        <% if User.find(@ballot.member_id) == current_user %>
          <%= User.find(@ballot.author_id) %> has invited you to join a community!