app/views/ballots/index/_table_display.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 7 LIMIT 1
---
          <% if ballot.vote_type == "add_community_member" %>
            <% if User.find(ballot.member_id) == current_user %>