app/controllers/ballots_controller.rb

  def show
     @ballot = Ballot.find(params[:id])

    if @ballot.vote_type == "exception"
      @email = Email.find(@ballot.content_id)
    end

    community_members = []
    community_user_ids = []
    @community_memberships = Membership.find(:all, :conditions => ["community_id = ?", @ballot.content_id])
    @community_user_ids = @community_memberships.map {|c| c.user_id}
    @community_members = User.find(:all, :conditions => ["id IN (?)",@community_user_ids])

    @cvotes = []
    cvotes_user_ids = []
    @pending_members = []
    @accept_members = []
    @reject_members = []
    #KJS: for all types?
    #@cvotes = Cvote.find(:all, :conditions => {:ballot_id => @ballot.id})
    @all_ballots_in_community = Ballot.find(:all, :conditions => ["content_id = ?", @ballot.content_id])
    @cvotes = Cvote.find(:all, :conditions => ["ballot_id IN (?)", @all_ballots_in_community ])
---
SELECT "ballots".* FROM "ballots" WHERE "ballots"."id" = ? LIMIT 1  [["id", "16"]]
SELECT "memberships".* FROM "memberships" WHERE (community_id = 6)
SELECT "users".* FROM "users" INNER JOIN "cvotes" ON "users"."id" = "cvotes"."user_id" WHERE "cvotes"."ballot_id" = 16
SELECT "cvotes".* FROM "cvotes" WHERE "cvotes"."id" = ? LIMIT 1  [["id", 47]]

      if @ballot.myballots_type == "Community"
        if @ballot.vote_type == "add_community_member" or @ballot.vote_type == "leave_community"
          @cvote.approval = true
          @cvote.save
---
UPDATE "cvotes" SET "approval" = 't', "updated_at" = '2013-07-30 16:35:00.470576' WHERE "cvotes"."id" = 49