app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "7"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 16 LIMIT 1
SELECT "comment_annotations".* FROM "comment_annotations" WHERE "comment_annotations"."comment_id" = 7
SELECT "communities".* FROM "communities" WHERE (id IN (2,4,2,4))
---
  def new
    #debugger
    if logged_in?
      @parent_id = params.delete(:parent_id)
      #@parent_id = params[:parent_id]
      @commentable = find_commentable
      puts "************ comments_controller: new .... parent_id : "  + @parent_id.to_s
      @comment = Comment.new( :parent_id => @parent_id,
                              :commentable_id => @commentable.id,
                              :commentable_type => @commentable.class.to_s)

      @parent_comment = Comment.find(@parent_id)

      @comment_user = User.find(:first, :conditions => {:id => @parent_comment.user_id})

      comment_community_ids = []
      comment_annotations = CommentAnnotation.find(:all, :conditions => {:comment_id => @parent_id} )
      for annotation in comment_annotations
        comment_community_ids.push(annotation.community_id)
      end
      @commnent_communities = Community.find(:all, :conditions => ["id IN (?)", comment_community_ids])

SELECT "comment_annotations".* FROM "comment_annotations" WHERE "comment_annotations"."comment_id" = 7
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "7"]]
---
  def create
    #debugger
    puts "******************  comments_controller: create"
    if logged_in?
      @commentable = find_commentable
      @comment = @commentable.comments.build(params[:comment])

      #from check-boxes
      selected_ids = []
      if params[:community_ids]
        selected_ids = params[:community_ids].collect {|id| id.to_i}
        #puts "************** selected_id: " + selected_id.to_s
      end
      @parent_id = @comment.parent_id

      story_annotations = []

      if selected_ids.empty?
        debugger
        unless @comment.nil?
          story_annotations = CommentAnnotation.find(:all, :conditions => {:comment_id => @parent_id})
          debugger
        else
          story_annotations = Annotation.find(:all, :conditions => {:story_id => @commentable.id} )

INSERT INTO "comments" ("ancestry", "body", "commentable_id", "commentable_type", "created_at", "story_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "comments" SET "user_id" = 17, "story_id" = 281, "updated_at" = '2013-07-30 19:32:31.219666' WHERE "comments"."id" = 7
---
        end
      end

      if @comment.save

UPDATE "stories" SET "popularity" = 20, "updated_at" = '2013-07-30 19:32:31.244514' WHERE "stories"."id" = 281
---
        #@comment.update_attributes(:user_id  => current_user.id, :story_id => @commentable.id) ==> not working
        @comment.user_id = current_user.id
        @comment.story_id = @commentable.id
        @comment.save

SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "281"]]
---
      #debugger

      # increment story popularity
        story = Story.find(params[:story_id])