app/controllers/communities_controller.rb

  def index
    if logged_in?
      @filter = params[:filter]

      if @filter.nil?
        @filter = "current"
      end

      if @filter == "current"
        @communities = current_user.communities.current_communities
      elsif @filter == "archived"
        @communities = current_user.communities.archived_communities
      else
        @communities = []
      end

      @myCommunities = current_user.communities.autocomplete(params[:term])
      @selected = []
      @myCommunities.each do |c|

      @membership = Membership.find(:first, :conditions => ["community_id = " + c.id.to_s + " AND " + "user_id = " + current_user.id.to_s])
---
SELECT "communities".* FROM "communities"
SELECT "memberships".* FROM "memberships" WHERE (community_id = 1 AND user_id = 7) LIMIT 1

  def show
    if logged_in?
      @community = Community.find(params[:id])

      #KJS: Aug. 2. 2013

    community_members = []
    community_user_ids = []
    @community_memberships = Membership.find(:all, :conditions => ["community_id = ?", @community.id])
    @community_user_ids = @community_memberships.map {|c| c.user_id}
    @community_members = User.find(:all, :conditions => ["id IN (?)",@community_user_ids])

    @cvotes = []
    cvotes_user_ids = []
    @pending_members = []
    @accept_members = []
    @reject_members = []
    @left_members = []
    #KJS: for all types?
    #@cvotes = Cvote.find(:all, :conditions => {:ballot_id => @ballot.id})
    @all_ballots_in_community = Ballot.find(:all, :conditions => ["content_id = ?", @community.id])
    @cvotes = Cvote.find(:all, :conditions => ["ballot_id IN (?)", @all_ballots_in_community ])
---
SELECT "communities".* FROM "communities" WHERE "communities"."id" = ? LIMIT 1  [["id", "7"]]
SELECT "memberships".* FROM "memberships" WHERE (community_id = 6 AND user_id = 7) LIMIT 1
SELECT "users".* FROM "users" WHERE (id IN (7,17,20,13,20,13,13,20,13))
SELECT "ballots".* FROM "ballots" WHERE (content_id = 6 AND author_id = 17 AND vote_type= 'leave_community') LIMIT 1
SELECT "cvotes".* FROM "cvotes" WHERE (ballot_id IN (34,35,36) AND user_id = 16 AND approval = true) LIMIT 1

  def create
    if logged_in?

      @community = Community.new(params[:community])
      @community.name.strip!

    #invalid_members and invalid_communities used for COPS error reporting
      @invalid_members = []
      @invalid_communities = []

    #'members' will hold all of the potential members for this community
      @members = [current_user]

    #if user entered some email addresses add them to @members
      if !params[:members].nil?
        @member_emails = params[:members].split(/[,;]\s?/)
        @member_emails.each do |member|
          @member = User.find_by_email(member.strip)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'tom@company.com' LIMIT 1

        if (@invalid_members.size > 0 or @invalid_communities.size > 0) or (@members.empty?)
          format.html{render 'communities/new/errors', :locals => {:invalid_members => @invalid_members, :invalid_communities => @invalid_communities, :members => @members}}
        else
          if @community.save
            #Create a new ballot for this community's creation
            @newcommunity_ballot = Ballot.new('content_id' => @community.id, 'over' => false, 'vote_type' => 'new_community', 'users' => @members, 'author_id' => current_user.id)
            @newcommunity_ballot.save
            @newcommunity_ballot.create_notification(:message => "New Community (#{@community.name}) 1/#{@members.count} votes", :finished => false)
            @community.ballots << @newcommunity_ballot
            #Set author ballot to true since they're the creator of the vote
            @author_vote = @newcommunity_ballot.cvotes.find_by_user_id(current_user.id)
            @author_vote.approval = true
            @author_vote.save
            @community.users << User.find(current_user.id)
---
INSERT INTO "communities" ("approved", "archived", "created_at", "description", "name", "updated_at", "voteable") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "ballots" ("author_id", "content_id", "created_at", "member_id", "myballots_id", "myballots_type", "outcome", "over", "updated_at", "vote_type") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "notifications" ("approved", "ballot_id", "created_at", "finished", "message", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT "notifications".* FROM "notifications" WHERE "notifications"."ballot_id" = 19 LIMIT 1
SELECT "cvotes".* FROM "cvotes" WHERE "cvotes"."ballot_id" = 19 AND "cvotes"."user_id" = 16 LIMIT 1
UPDATE "ballots" SET "myballots_id" = 9, "myballots_type" = 'Community', "updated_at" = '2013-07-30 16:54:24.373454' WHERE "ballots"."id" = 19
UPDATE "cvotes" SET "approval" = 't', "updated_at" = '2013-07-30 16:54:24.378461' WHERE "cvotes"."id" = 57
SELECT "users".* FROM "users" WHERE "users"."id" = 16 LIMIT 1

  def update
    if logged_in?
      @community = Community.find(params[:id])
      @edit_type = params[:edit_type]
      if @edit_type == 'add'
        @person = User.find_by_email(params[:add_person])
      elsif @edit_type == 'remove'
        @person = User.find_by_email(params[:remove_person])
      elsif @edit_type == 'leave'
        @person = User.find_by_email(params[:leave_person])
      end
      debugger
      #This is needed for the jQuery .submit() call
      @archive = params["archive_#{@community.id}".to_sym]
      @community.archived = @archive unless @archive.nil?
      @community.save

      #Don't let more than one vote per member occur
      # if @edit_type == 'add' or @edit_type == 'remove'
      #   @community.ballots.each do |b|
      #     if b.member_id == @person.id and b.over == false
      #       redirect_to(community_path(@community), :notice => "There is already a message in progress for " + @person.to_s)
      #       return
      #     end
      #   end
      # end
      if @edit_type == 'add'
        if @person == current_user
          redirect_to(community_path(@community), :notice => "You can't add/remove yourself from the community!")
          return
        elsif @community.users.include?(@person)
---
SELECT "communities".* FROM "communities" WHERE "communities"."id" = ? LIMIT 1  [["id", "7"]]
SELECT "users".* FROM "users" WHERE "users"."email" = 'allison@company.com' LIMIT 1
UPDATE "communities" SET "voteable" = 'f', "updated_at" = '2013-07-30 18:29:12.661610' WHERE "communities"."id" = 7
SELECT 1 AS one FROM "users" WHERE (LOWER("users"."email") = LOWER('bob@company.com') AND "users"."id" != 7) LIMIT 1
SELECT DISTINCT 1 AS one FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."community_id" = 7 AND "users"."id" = 20 LIMIT 1

        @editcommunity_ballot = Ballot.new('content_id' => @community.id, 'over' => false,
          'vote_type' => 'add_community_member', 'users' => @community.users + [@person],
          'member_id' => @person.id, 'author_id' => current_user.id)
        @editcommunity_ballot.save
        @editcommunity_ballot.create_notification(:message => "Add Member (#{@community.name}) 1/#{@community.users.count+1} votes", :finished => false)
---
INSERT INTO "ballots" ("author_id", "content_id", "created_at", "member_id", "myballots_id", "myballots_type", "outcome", "over", "updated_at", "vote_type") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "ballots" SET "myballots_id" = 7, "myballots_type" = 'Community', "updated_at" = '2013-07-30 16:31:22.214613' WHERE "ballots"."id" = 16
INSERT INTO "notifications" ("approved", "ballot_id", "created_at", "finished", "message", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT "notifications".* FROM "notifications" WHERE "notifications"."ballot_id" = 16 LIMIT 1

      if @edit_type == 'add' or @edit_type == 'remove' or @edit_type == 'leave'
        #The person starting the vote will have their vote set to True automatically
        debugger
        @current_user_vote = Cvote.find_by_user_id_and_ballot_id(current_user.id, @editcommunity_ballot.id)
---
SELECT "cvotes".* FROM "cvotes" WHERE "cvotes"."user_id" = 7 AND "cvotes"."ballot_id" = 16 LIMIT 1