app/controllers/cvotes_controller.rb

  def voteaction
    if params[:vote_yes] || params[:vote_no]
      update
      return #KJS: should provide this....avoiding double rendering
    end
    if params[:submit_yes]
      #debugger
        #puts "************ cvotes_controller: voteaction: yes"
        Cvote.update_all(["approval=?", true], :id => params[:cvote_ids])
        #KJS
        cvote_yes_ids = params[:cvote_ids]
        #update memberships....
        if params[:cvote_ids]
          cvote_yes_ids.each do |yes_id|
            @cvote = Cvote.find(yes_id)
            @ballot = @cvote.ballot
            @community = Community.find(@ballot.content_id) #through annotations
            @community.users << User.find(current_user.id)
            @community.save
          end
        end
    elsif params[:submit_no]
        Cvote.update_all(["approval=?", false], :id => params[:cvote_ids])
    end
    #need to call vote_check for all of the ballots we're voting on
    if params[:cvote_ids]
      cvote_ids = params[:cvote_ids]
      cvote_ids.each do |cvote_id|
        @cvote = Cvote.find(cvote_id)
---
UPDATE "cvotes" SET "approval" = 't', "updated_at" = '2013-07-30 16:37:34.912241' WHERE "cvotes"."id" = 50
SELECT "cvotes".* FROM "cvotes" WHERE "cvotes"."id" = ? LIMIT 1  [["id", "50"]]
SELECT "ballots".* FROM "ballots" WHERE "ballots"."id" = 16 LIMIT 1
SELECT "communities".* FROM "communities" WHERE "communities"."id" = ? LIMIT 1  [["id", 7]]
SELECT "users".* FROM "users" WHERE "users"."id" = 20 LIMIT 1
UPDATE "ballots" SET "over" = 't', "outcome" = 'success', "updated_at" = '2013-07-30 20:14:10.256324' WHERE "ballots"."id" = 26
SELECT "cvotes".* FROM "cvotes" WHERE "cvotes"."ballot_id" = 16