app/controllers/discuss_controller.rb

SELECT "communities".* FROM "communities" WHERE (name = 'Public') LIMIT 1
INSERT INTO "stories" ("created_at", "description", "external_popularity", "fb_comments_count", "fb_id", "fb_likes_count", "fb_link", "fb_type", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "image_url", "kind", "latitude", "longitude", "popularity", "published_at", "related_story_id", "source", "source_url", "title", "topic_id", "tweets_count", "twitter_id", "twitter_retweet_count", "updated_at", "url", "user_id", "views") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "annotations" ("community_id", "created_at", "story_id", "updated_at") VALUES (?, ?, ?, ?)  [["community_id", 5], ["created_at", Tue, 30 Jul 2013 19:31:17 UTC +00:00], ["story_id", 281], ["updated_at", Tue, 30 Jul 2013 19:31:17 UTC +00:00]]
INSERT INTO "activity_items" ("comment_id", "community_id", "created_at", "kind", "story_id", "topic_id", "updated_at", "user_id", "vote_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
      end
#debugger
      if selected_ids.nil? || selected_ids.empty?
        public_community = Community.find(:first, :conditions => "name = 'Public'")
        selected_ids.push(public_community.id)
      end
      if story.save
        flash[:notice] = "Your post '" << story.title << "' was successfully posted!"
        selected_ids.each do |sel_id|
          Annotation.new(:story_id => story.id, :community_id => sel_id).save!
        end
        # create activity
        activity = ActivityItem.create(
          :story_id => story.id,
          :user_id  => current_user.id,
          :topic_id => -1,
         # :community_id => selected_id, #KJS, not used....for multiple communities..
          :kind     => ActivityItem::CreatePostType)