app/controllers/stories_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."story_id" IN (115)
SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "280"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 20 LIMIT 1
SELECT "topics".* FROM "topics" WHERE "topics"."id" = -1 LIMIT 1
SELECT "stories".* FROM "stories" WHERE (kind = 1 and user_id != 6) ORDER BY published_at DESC LIMIT 5
---
  def show
    #debugger
    @story = Story.includes(:comments => :user).find(params[:id])

    if (!@story)
      redirect_to root_url
    end

    if @story.topic_id != -1
      # topic maybe invalid..
      begin
        @topic = Topic.find(@story.topic_id)
        @more_stories = Story.find :all,
          :conditions => "topic_id = #{@topic.id} AND id != #{@story.id}",
          :order => "created_at DESC",
          :limit => 5

SELECT "memberships".* FROM "memberships" WHERE "memberships"."selected" = 't' AND "memberships"."user_id" = 20
SELECT "annotations".* FROM "annotations" WHERE (community_id IN (5))
UPDATE "stories" SET "views" = 18, "updated_at" = '2013-07-30 19:29:25.012735' WHERE "stories"."id" = 280
---
      community_ids = []
      sel_story_ids = []
      if logged_in?
        selectedmemberships = Membership.find(:all, :conditions => {:selected => true, :user_id => current_user.id} )
        for membership in selectedmemberships
          community_ids.push(membership.community_id)
        end
        annotations = Annotation.find(:all, :conditions => ["community_id IN (?)", community_ids])
        for annotation in annotations
          sel_story_ids.push(annotation.story_id)

SELECT "annotations".* FROM "annotations" WHERE "annotations"."story_id" = 280
---
    if logged_in?
      if @story.kind == Story::Post || @story.kind == Story::Rss
        story_community_ids = []
        story_annotations = Annotation.find(:all, :conditions => {:story_id => @story.id} )

SELECT "communities".* FROM "communities" WHERE (id = 5) LIMIT 1
---
            story_community_ids.push(annotation.community_id)
          end

          @story_communities = Community.find(:all, :conditions => ["id IN (?)", story_community_ids])

SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "280"]]
DELETE FROM "stories" WHERE "stories"."id" = ?  [["id", 280]]
SELECT "users".* FROM "users" WHERE "users"."id" = 20 LIMIT 1
SELECT "topics".* FROM "topics" WHERE "topics"."id" = -1 LIMIT 1
---
  def destroy
    if not logged_in?
      flash[:alert] = "You need to login to delete a story!"
      redirect_back_or(root_url)
    elsif current_user.is_admin?
      @story = Story.find(params[:id])
      @title = @story.title
      @topic = @story.topic
      @story.destroy
      flash[:notice] = "The story '" << @title << " ' was successfully deleted!"
      redirect_to root_url
    elsif not current_user.id == Story.find(params[:id]).user.id
      flash[:alert] = "You need to be the author of the story to delete it!"
      redirect_back_or(root_url)
    else
      @story = Story.find(params[:id])