app/controllers/topics_controller.rb

      end
    end

    stories = Story.find(:all,
      :conditions => conditions,
      :order => "created_at DESC")
---
SELECT "stories".* FROM "stories" WHERE ((kind = 2) AND published_at >= '2013-06-17 18:30:14.873482' AND published_at <= '2013-06-25') ORDER BY created_at DESC